# 방법 1
print("나는 %d살입니다." % 20) # 퍼센트 사용시 뒤 값이 들어감 (정수)
print("나는 %s을 좋아해요." % "파이썬") # 문자열
print("Apple 은 %c로 시작해요." % "A") # 문자

print("나는 %s색과 %s색을 좋아해요." % ("파란", "빨간")) # 여러개 넣기

# 방법 2
print("나는 {}살입니다.".format(20)) # {}치고 포멧 사이에 값 입력
print("나는 {}색과 {}색을 좋아해요.".format("파란", "빨간")) # 여러개 사용
print("나는 {0}색과 {1}색을 좋아해요.".format("파란", "빨간")) # {} 안에 숫자로 순번 설정
print("나는 {1}색과 {0}색을 좋아해요.".format("파란", "빨간"))

# 방법 3
print("나는 {age}살이며, {color}색을 좋아해요.".format(age=20, color="빨간")) # 변수 처럼 사용가능
print("나는 {age}살이며, {color}색을 좋아해요.".format(color="빨간", age=20)) # 뒤에 순서는 상관없음

# 방법 4 (v3.6 이상~)
age = 20
color = "빨간"
print(f"나는 {age}살이며, {color}색을 좋아해요.") # ""이전에 f 사용시 format과 같은 성능